import './home.css'
import Massege from './Massege';


export default function Home(){


    return (
        <>
  
        <div className="home-content">
        <h1 className="main-heading">ברוכים הבאים לקמפיין התרומות של "יד שרה"!</h1>
      
        <p className="description">
          לתרום ולעזור – זו הדרך שלנו לשנות חיים.
        </p>
      
        <p className="section-heading">המשימה של עמותת יד שרה</p>
        <p className="content-text">
          המשימה של עמותת יד שרה היא לספק סיוע רפואי ושירותים חברתיים לאנשים עם מוגבלות וקשישים, 
          כדי לאפשר להם חיים עצמאיים ומלאים יותר. אנו פועלים למען אלו שזקוקים לעזרה, באמצעות ציוד רפואי מתקדם, 
          שירותים פרטניים ופעילויות חברתיות שיכולות לשפר את איכות חייהם.
        </p>
      
        <p className="section-heading">מה זה קמפיין התרומות שלנו?</p>
        <p className="content-text">
          הקמפיין הזה נועד לגייס תרומות עבור פעילויותינו המגוונות, כדי שנוכל להמשיך ולהעניק עזרה למי שצריך אותה ביותר. 
          התרומות שלך מסייעות לרכישת ציוד רפואי, שיפור השירותים הקיימים, והרחבת תוכניות החינוך וההכשרה שלנו.
        </p>
      
        <p className="section-heading">למה כדאי לתרום?</p>
        <p className="content-text">
          כשאתה תורם, אתה לא רק עוזר לנו להפעיל את שירותינו, אלא גם הופך לחלק מקהילה גדולה של אנשים שמאמינים בכוח של עזרה הדדית. 
          התרומות שלך משפיעות ישירות על חייהם של אנשים רבים, ומסייעות להעניק להם את הכלים וההזדמנויות לחיים טובים יותר.
        </p>
      
        <p className="section-heading">איך אפשר לתרום?</p>
        <p className="content-text">
          התרומה שלך פשוטה ונגישה! כל תרומה, קטנה או גדולה, עושה הבדל. לחצו על כפתור "תרום" למעלה ותמכו בקמפיין. 
          כל תרומה נחשבת, וכל צעד קטן מביא אותנו צעד אחד קרוב יותר לעזור לכמה שיותר אנשים.
        </p>
      
        <p className="closing">
          ביחד נוכל להמשיך את הדרך של יד שרה, ולעזור לעוד אנשים לחיות חיים טובים, עצמאים ומספקים.
        </p>
      
        <p className="thank-you">
          תודה רבה על תמיכתך!
        </p>
      </div>



      <img className='img' src="../src/assets/images/מוטו.png" alt=""  />

      <Massege/>


  

      </>
      

    )
}